//odinms_MS
importPackage(net.sf.odinms.tools);
importPackage(net.sf.odinms.client);

var status = 0;

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0 && status == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			
			cm.sendSimple("\t\t\t\t\t#e#r流浪商人#b系列#n\r\n#d====================================================\r\n#d目前账户剩余金币:"+ cm.getMeso() + "\r\n====================================================\r\n#k您好，欢迎来到#b昭和村毛利诊所#k，我是整形医生#r毛利#k\r\n#k#r#e私下告诉你，表面上我是医生，实际上问谁不是为了钱，实话实说我就是流浪商人，出售所有专属紫金枫叶装备！#n\r\n\r\n#L1##r#e别以为我不知道你赌场出老千的事#n#k\r\n\r\n#L2#专属紫金枫叶黄金帽（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L3#专属紫金枫叶套装（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L4#专属紫金枫叶手套（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L5#专属紫金枫叶鞋（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L6#专属紫金枫叶腰带（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L7#专属紫金枫叶披风（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L8#2013运动会优胜组耳环（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L9#超级枫叶项链（攻击力30/魔力50==#r150张#k#v4000313#）#n\r\n\r\n#L10#10周年大赏枫叶脸饰（攻击力30/魔力50==#r150张#k#v4000313#）");			                } else if (status == 1) {
                  if (selection == 1) {
		  cm.sendOk("          \t\t\t#e#b会飞的流浪商人#n#d\r\n====================================================#k\r\n呵呵，我出老千也不是一次两次了，谁怕谁啊！！#d\r\n====================================================#k\r\n大哥我错了，千万别告诉暮木警官，给点面子，我告诉你一个秘密！别急听我慢慢道来。。。#d\r\n====================================================#k\r\n前些天我去买炒面，打包出门竟然看见天上有只#r会飞的猪#k。。真的会飞啊你别不信，把我的炒面都抢走了。。。\r\n====================================================#k\r\n好了，别再来问我问题，要不要买东西啊，不买就走吧！#d\r\n");
	          cm.dispose();
                  }else if(selection == 2){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶黄金帽.");
                cm.gainItem(1003552,0,0,0,0,0,0,30,50,0,0,0,0,0,0);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶黄金帽！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();
                  }
                  }else if(selection == 3){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶套装.");
                cm.gainItem(1052461,0,0,0,0,0,0,30,50,0,0,0,0,0,0);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶套装！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 4){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶手套.");
                cm.gainItem(1082433,0,0,0,0,0,0,30,50,0,0,0,0,0,0);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶手套！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 5){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶鞋.");
                cm.gainItem(1072666,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶鞋！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 6){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶腰带.");
                cm.gainItem(1132154,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶腰带！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }else if(selection == 7){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的专属紫金枫叶披风.");
                cm.gainItem(1102441,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的专属紫金枫叶披风！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                  }
                  }
                  else if(selection == 8){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的2013运动会优胜组耳环.");
                cm.gainItem(1032160,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的2013运动会优胜组耳环！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                }
                }
                else if(selection == 9){ 	           
                  if (cm.haveItem(4000313,150)){
                  cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的枫叶超级项链.");
                  cm.gainItem(1122110,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                  cm.gainItem(4000313,-150);
                  // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的枫叶超级项链！！");
                  cm.dispose();		
                  }else{ 
                  cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                  cm.dispose();	 
                  }
                  }
                  else if(selection == 10){ 	           
                if (cm.haveItem(4000313,150)){
                cm.sendOk("#r#e恭喜您获得攻击力30/魔力50的10周年大赏枫叶脸饰.");
                cm.gainItem(1012474,0,0,0,0,0,0,30,50,0,0,0,0,5,5);
                cm.gainItem(4000313,-150);
                // cm.喇叭(3,"厉害了word哥！！恭喜您获得了攻击力30/魔力50的10周年大赏枫叶脸饰！！");
                cm.dispose();		
                }else{ 
                cm.sendOk("#b您没有足够的黄金枫叶进行购买,请努力收集吧.");
                cm.dispose();	 
                }
                }
	}
    }
}
